music_app/app/controllers/albums_controller.rb

  def create
    album = Album.new(album_params)
    @band = Band.find(params[:band_id])
    album.band_id = @band.id
    if album.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "year", "band_id", "album_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "best album"], ["year", 2017], ["band_id", 2], ["album_type", "studio"], ["created_at", "2019-09-05 19:07:57.736015"], ["updated_at", "2019-09-05 19:07:57.736015"]]