music_app/app/controllers/bands_controller.rb

    def destroy
      band = Band.find(params[:id])
      band.destroy
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]