music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Favorite band"], ["created_at", "2019-09-05 17:27:00.712049"], ["updated_at", "2019-09-05 17:27:00.712049"]]
---
  def create
    band = Band.new(band_params)
    if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "coderband"], ["updated_at", "2019-09-05 21:25:58.671332"], ["id", 5]]
---
    def update
      band = Band.find(params[:id])
      band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
---
    def destroy
      band = Band.find(params[:id])
      band.destroy