music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 1], ["body", "great song!"], ["created_at", "2019-09-05 20:39:02.699867"], ["updated_at", "2019-09-05 20:39:02.699867"]]
---
  def create
    note = Note.new(note_params)
    note.track_id = params[:track_id]
    note.user_id = self.current_user.id
    note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
  def destroy
    note = Note.find(params[:id])
    note.destroy