music_app/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: the_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tester@gmail.com"], ["LIMIT", 1]]