music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @album = Album.find(params[:album_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tracks" ("title", "album_id", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "enumerables"], ["album_id", 5], ["ord", 1], ["lyrics", "select reject map each "], ["created_at", "2019-09-05 19:45:11.968785"], ["updated_at", "2019-09-05 19:45:11.968785"]]
---
  def create
    track = Track.new(track_params)
    album = Album.find(params[:album_id])
    track.album_id = params[:album_id]
    if track.save