music_app/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tester@gmail.com"], ["password_digest", "$2a$12$gPg/Cxs1FwXKsZE8/JStfenMqekPBK3UD5jRuZbgxKjmhLgbn4Pcq"], ["session_token", "V3pR8mM1UlE7Nnf8_lYfIg"]]