music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<h1>BANDS!!</h1>
<% Band.all.each do |band| %>