music_app/app/views/bands/show.html.erb

<label for="albums"><%= @band.name + "'s" %> Albums</label>
<% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 4]]