music_app/app/views/tracks/new.html.erb

<br>
<% @album.tracks.each do |track| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]